<article>
  <section class='r'>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>北港朝天宮<div class="fb-like" data-href="<?php echo base_url ('march19');?>" data-send="false" data-layout="button_count" data-action="like" data-show-faces="false" data-share="true"></div></h2>

    <p>俗稱北港媽祖廟，這座位於<b>雲林縣北港鎮中山路178號</b>的廟宇，目前被列為中華民國<b>二級古蹟</b>，是座主祀媽祖的廟宇，目前也為台灣最具影響力及分靈眾多的媽祖廟之一。</p>
    <p>清康熙三十三年(西元1694年)，<b>樹璧和尚</b>自湄洲嶼朝天閣奉請媽祖來台，航途中遇暴風雨漂流至笨港(今北港)，樹璧和尚認為此為神意，遂將媽祖奉祀於笨港街，並建天妃廟，後改名天后宮，再改今朝天宮。</p>
    <p>據說樹壁和尚將媽祖神像請至北港後，曾在一處古井上休息，並暫時將媽祖神像安置於古井上，不過後來當樹壁和尚要動身離開時，媽祖神像卻再也搬不動。後來經過請示，得知媽祖欲在此地建廟，而造就了今日的朝天宮。傳說今朝天宮正殿媽祖正下方，即為當年古井所在。</p>
  </section>

  <section>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>
    <h2>北港廟會</h2>
    <p>農曆三月期間在臺灣各地迎媽祖的廟會活動非常頻繁，而在這段時間的北港鎮更能看到媽祖廟會的盛況非常，它對北港人的意義更是第二個過年一般，多數在外地工作的北港遊子都會回鄉參與！</p>
    <p>每當到了農曆三月十九上午，大家都在等著廟口<b>起馬炮</b>點燃，燃後蹦的一聲，繞境隊伍開始出發了，漸漸的北港街頭鞭炮聲四起，廟會遶境就此正式已經開始！夜晚街道上可見家家戶戶都會用<b>辦桌</b>的方式來邀請遠方親友一同慶賀媽祖聖誕！</p>
    <p>廟會期間，沿路上可見每家每戶都準備好香案、水果和金爐來恭迎媽祖聖駕。從農曆十九日至二十三日媽祖聖誕當天，街道上不只有陣頭遶境的活動，還有<b>真人藝閣</b>遊行！目前真人藝閣在台灣已經是越來越少見，北港藝閣數量目前是全台數量最多的藝閣遶境。</p>
    <p>這兩天北港朝天宮內的祖媽、二媽、三媽、四媽、五媽、六媽等媽祖鑾轎及其前鋒太子爺、虎爺等宮內的神明皆會出巡繞境，並且北港在地的廟宇與宗教社團也都會一起共襄盛舉，沿途信徒會施放大量的鞭炮希望事業「愈炸愈發」，活動當天各式各樣的陣頭與藝閣繞境隊伍綿延可達好幾公里。</p>
    <p>通常一般神明出巡都走大路大街為主，而北港媽祖卻是大街小巷都走，只要巷子神轎可以進的去、出的來，再小的巷子媽祖的隊伍都會進去走走繞繞，當看到神轎進去只能剛好容納轎子寬度的巷子時，心中真有著莫名的感動，看到朝向媽祖神轎跪拜的信徒，那種濃濃的神與人的情感與寄託，更是可以發現北港媽祖對於當地人的重要性。</p>
  </section>

  <section class='r'>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>三月十九</h2>

    <p>我想一定會有人問，為什麼北港迎媽祖活動會是在農曆三月十九、二十，而不是二十三日媽祖誕辰當天呢？</p>
    <p>這要追朔於早期朝天宮會都在媽祖生日前夕回到湄州祖廟謁祖進香，而當回到北港時，時間就是在農曆三月十九日，所以當進香完後的隊伍回到北港時，也就會在這一天在北港境內出巡祈福，而原本一天的繞境活動也於民國四十四年擴大至兩天！</p>
    <p>近年北港迎媽祖的活動也於 2008年被指定為「台灣文化資產」，並與台東炸寒單、鹽水蜂炮並稱為「台灣三大炮」，更於 2011年受中華民國行政院文建會指定為國家重要民俗。 </p>
  </section>

  <section>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>北港犁炮</h2>

    <p>廟會鞭炮對於北港囝仔來說是件重要的回憶與活動，有句台灣俗話「北港炮 新塭金」，就是在說鞭炮對於北港人的特殊意義，北港人更會用「吃炮」來表示對媽祖的崇敬之意，若你問北港人為什麼看似不會害怕鞭炮、都敢在鞭炮上採踏，他們大約都會說「北港囝仔毋驚炮」，這是因為多數的北港人自小都會參與三月十九的活動，所以自小就習慣了鞭炮聲，而這樣的一個習俗也成就了台灣三大炮之一的名聲。</p>
    <p>通常當神轎吃炮時，剎那間火光四飛、煙霧滿天聲音之大有如雷聲，炸完的下一秒天空就會下起炮屑雨來，當炮屑灑落一地時，四周自然的就會響起歡呼掌聲，所以北港人常會驕傲的說<b>北港囝仔毋驚炮</b>！</p>

  </section>
  
  <section class='r'>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>
    <h2>吃炮(喫炮)</h2>

    <p>吃炮是個怎麼個吃法？依據北港當地陣頭的習慣最主要會分成三種方式: 1.犁炮 2.踩炮 3.炸轎。</p>
    <p><b>犁炮</b> 顧名思義就是用<b>犁頭生</b>(犁頭鐵質部)搭配<b>火爐</b>施放，當火爐中的木炭將犁頭生燒紅時，就可以用來點燃手中的<b>排炮</b>(尺炮)並在點燃的同時丟向神轎，這種燃放鞭炮的方式稱為犁炮，而後期也有直接使用香來當成引燃的工具。</p>
    <p><b>踩炮</b> 就是用腳踏鞭炮囉！一般會先在馬路上使用<b>竹竿炮</b>(連珠炮)鋪成<b>鞭炮地毯</b>，當神轎經過的同時一並引燃，踏著腳下引燃的鞭炮前進的方式稱為踩炮。</p>
    <p><b>炸轎</b> 當然就是用一大堆的鞭炮來炸媽祖的神轎，這是目前北港吃炮常見的方式，所以也有人說這個就是「吃炮」。</p>
    <p>說到鞭炮文化，推薦北港最猛的吃炮陣頭「<b>虎爺</b>」，虎爺是北港媽祖出巡中最會「喫炮」的神轎，在濃煙漫天、轟隆作響的場景中，「虎爺轎」屹立不搖，轎夫無畏無懼的神采，讓群眾懾服。每當起馬炮放完，太子先鋒出發後，大夥最期待的就是虎爺吃炮了，其炮量一定會讓你驚訝不已！</p>
    <p>近期幾年在<b>金垂髫鄉土文史協會</b>的推廣之下，多數的吃炮方式慢慢的又回復成使用犁頭生搭配火爐的古早式犁炮，在三月十九的這幾天，都可以在媽祖廟廣場前、圓環等路口看到這種傳統的北港犁炮，而現場民眾也都有機會可以參與犁炮的活動喔！</p>

  </section>


  <section>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>真人藝閣</h2>

    <p>繞境隊伍中，你不但可以看到具有歷史的傳統陣頭，還可以看到各式的<b>藝閣</b>花車，每輛藝閣都會有個主題故事，而藝閣上也有著很小朋友扮演故事中的角色，那些人物可都是真人的不是一般的電動假人偶！</p>
    <p>藝閣的「藝」指的是<b>南管</b>樂器彈唱的藝旦，而「閣」則指的是架子上臵放食物的木板，兩者合在一起則有為藝術之閣、詩意之閣。</p>
    <p>一般扮演藝閣都會由十四歲以下的童男、童女，著古裝扮演戲劇角色。早期在民國四十年左右，由人工扛抬改為獸力，將「閣棚」裝臵於牛車上，由牛來拉動，後改以機動三輪車帶動，現在藝閣完全改用貨車車體，其外形比當年增大五倍之多！而視覺與藝術美感更勝以往！</p>
    <p>觀賞藝閣時，你只要對這些小朋友招招手，他們就會丟糖果給你！北港的真人藝閣，在台灣已經很少見了，藝閣花車也是行之有年的傳統陣頭之一，藝閣花車從以往的人力抬拉，進而慢慢演進變成用獸力，直到今天的機械動力，藝閣的演進也是一種文化的演進與蛻變，若是你沒看過這麼有特色的在地文化，不仿趁著這今年來北港瞧瞧吧！</p>
  </section>

  <section class='r'>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>百年藝陣</h2>

    <p>在北港的百年陣頭中，其實有很多都是即將失傳的民俗藝陣，甚至有些已經解散。身為一個北港人，我想應該讓更多人看到屬於臺灣特有的本土民俗文化，歡迎大家將北港這一份特色<b>分享</b>出去吧！</p>
    <p>文化古鎮當然不僅限於朝天宮的文物與活動，舉凡北港圓環的顏思齊紀念碑、三級古蹟義民廟、知名景點甕牆、美食小吃，這些都是北港的在地文化、特色。</p>
    <p>其實來到這古鎮，可以看到的不止是香客人潮、也不止是香紙鞭炮，如果細心品嘗這些人文藝術，其實可以看到先民開墾台灣的痕跡。如果要把每片磚瓦的故事講過一輪，我想那不是三言兩語的，想知道更多北港之美，歡迎各位親自到北港來玩吧！</p>
  </section>

</article>


<?php
  if ($prev || $next) { ?>
    <div class='np a'>
<?php if ($prev) { ?>
        <figure class='p'>
          <a href='<?php echo $prev['url'];?>'></a>
          <figcaption><a href='<?php echo $prev['url'];?>'><?php echo $prev['title'];?></a></figcaption>
        </figure>
      <?php
      }
      if ($next) {?>
        <figure class='n'>
          <a href='<?php echo $next['url'];?>'></a>
          <figcaption><a href='<?php echo $next['url'];?>'><?php echo $next['title'];?></a></figcaption>
        </figure>
      <?php
      }?>
    </div>
<?php 
  }