<article>
  <section class='r'>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>

    <h2>北港朝天宮</h2>

    <p>俗稱北港媽祖廟，這座位於<b>雲林縣北港鎮中山路178號</b>的廟宇，目前被列為中華民國<b>二級古蹟</b>，是座主祀媽祖的廟宇，目前也為台灣最具影響力及分靈眾多的媽祖廟之一。</p>
    <p>清康熙三十三年(西元1694年)，<b>樹璧和尚</b>自湄洲嶼朝天閣奉請媽祖來台，航途中遇暴風雨漂流至笨港(今北港)，樹璧和尚認為此為神意，遂將媽祖奉祀於笨港街，並建天妃廟，後改名天后宮，再改今朝天宮。</p>
    <p>據說樹壁和尚將媽祖神像請至北港後，曾在一處古井上休息，並暫時將媽祖神像安置於古井上，不過後來當樹壁和尚要動身離開時，媽祖神像卻再也搬不動。後來經過請示，得知媽祖欲在此地建廟，而造就了今日的朝天宮。傳說今朝天宮正殿媽祖正下方，即為當年古井所在。</p>

  </section>
  <section>
    <figure>
      <a href=''>
        <img alt="" src="http://comdan66.github.io/matsu/2015/img/site/chao-tian/01-04.jpg" />
      </a>
      <figcaption>北港朝天宮俗稱北港媽祖廟</figcaption>
    </figure>
    <h2>建築藝術</h2>
    <p>朝天宮不僅是台灣人民的宗教信仰中心，更是座建築藝術的代表，從廟程外的圍牆上就可看到民國初年所雕刻的四海龍王，其神韻各有特色更是台灣罕見之作。</p>
    <p>仰望屋頂更可以發現精彩的剪黏藝術作品，屋簷兩角有著逗趣的憨番扛廟角，而屋頂上隨處可見利用碎陶瓷瓦片剪黏出來的民間傳說故事。</p>
    <p>殿內八卦造型的天花板稱作藻井，是利用斗拱、榫卯的傳統工藝技巧所拼接出來的工匠藝術；梁上的兩旁更可以看到代表三元及第的螃蟹，以及多子多孫的南瓜、錢鼠。</p>
  </section>

</article>