<div class='tabs'>
  <a href='' class='active'>陣頭路關</a>
  <a href=''>藝閣路關</a>
  <a href=''>陣頭地圖</a>
  <a href=''>藝閣地圖</a>
</div>

<div class='content'>
  <h2>沿革簡介</h2>
  <section>
    清康熙卅三（公元一六九四年），福建湄洲朝天閣高僧樹璧奉請媽祖神尊來台，於農曆三月十九日午時登陸笨港（即今北港），神顯是永駐笨港，庇佑萬民，遂立祠奉祀，自此香火日盛。
  </section>
  <section>
    地方信眾為感念媽祖聖德，例由笨港渡海回湄洲謁祖，回程在台南安平登陸，三月十九日鑾駕回抵笨港，同時舉行盛大慶典與繞境。嗣因甲午戰爭後，清廷日漸衰弱，列強環伺，台灣割讓日本，海疆日險，謁祖行程因而停止，惟地方信眾為紀念此一例行謁祖活動，仍於每年十九日、二十日迎請聖母舉行繞境，祈求風調雨順、國泰民安，此即本盛會之由來。
  </section>
  <section>
    北港媽祖出巡繞境活動，經行政院文化部於民國九十九年六月十八日依據文化資產保存法第五十九條指定「北港朝天宮迎媽祖」為我國重要民俗。
  </section>

  <h2>出巡時間</h2>
  <div class='time'>
    <div class='l'>
      <h3>三月十九日 日間</h3>
      <ul>
        <li>上午九時整，出巡笨南港繞境（南巡）。</li>
        <li>下午一點半，各陣頭在中山路指定地點集合。</li>
        <li>下午兩點整，隨聖母繞境遊行街內，下午六點入廟。</li>
      </ul>
      <h3>三月十九日 晚間</h3>
      <ul>
        <li>晚間七點準備。</li>
        <li>晚間七點半，各陣頭在中山路指定地點集合。</li>
        <li>晚間八點整出廟。</li>
      </ul>
    </div>
    <div class='r'>
      <h3>三月二十日 日間</h3>
      <ul>
        <li>上午九時整，出巡新街繞境（北巡）。</li>
        <li>下午一點半，各陣頭在中山路指定地點集合。</li>
        <li>下午兩點整，隨聖母繞境遊行街內，下午六點入廟。</li>
      </ul>
      <h3>三月二十日 晚間</h3>
      <ul>
        <li>晚間七點準備。</li>
        <li>晚間七點半，各陣頭在中山路指定地點集合。</li>
        <li>晚間八點整出廟。</li>
      </ul>
    </div>
  </div>
</div>