<?php defined('BASEPATH') OR exit('No direct script access allowed');

/**
 * @author      OA Wu <comdan66@gmail.com>
 * @copyright   Copyright (c) 2015 OA Wu Design
 */

class Migration_Add_menus extends CI_Migration {
  public function up () {
    $this->db->query (
      "CREATE TABLE `menus` (
        `id` int(11) NOT NULL AUTO_INCREMENT,
        `menu_id` int(11) DEFAULT NULL,
        `text` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '文字',
        `href` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '網址',
        `icon` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '圖示',
        `class` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '類別',
        `method` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '方法',
        `target` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '鏈結開啟方法',
        `sort` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '排列順序，上至下 ASC',
        `updated_at` datetime NOT NULL DEFAULT '" . date ('Y-m-d H:i:s') . "' COMMENT '新增時間',
        `created_at` datetime NOT NULL DEFAULT '" . date ('Y-m-d H:i:s') . "' COMMENT '更新時間',
        PRIMARY KEY (`id`),
        KEY `menu_id_index` (`menu_id`),
        FOREIGN KEY (`menu_id`) REFERENCES `menus` (`id`) ON DELETE CASCADE
      ) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;"
    );

    $this->db->query (
      "INSERT INTO `menus` (`id`, `menu_id`, `text`, `href`, `icon`, `class`, `method`, `target`, `sort`, `updated_at`, `created_at`)
        VALUES (1, NULL, '朝天宮', '', '', '', '', '_self', 0, '2015-09-14 16:50:28', '2015-09-14 16:50:28'),
               (2, NULL, '三月十九', '', '', '', '', '_self', 1, '2015-09-14 16:50:38', '2015-09-14 16:50:38'),
               (3, NULL, '百年藝陣', '', '', '', '', '_self', 2, '2015-09-14 16:50:54', '2015-09-14 16:50:54'),
               (4, NULL, '文化交流', '', '', '', '', '_self', 3, '2015-09-14 17:04:16', '2015-09-14 16:51:48'),
               (5, NULL, '美食旅遊', '', '', '', '', '_self', 4, '2015-09-14 16:51:58', '2015-09-14 16:51:58'),
               (6, NULL, '吾鄉笨港', '', '', '', '', '_self', 5, '2015-09-14 16:53:01', '2015-09-14 16:53:01'),
               (7, NULL, '其他資源', '', '', '', '', '_self', 6, '2015-09-14 16:53:16', '2015-09-14 16:53:16'),

               (8, 2, '陣頭路關', '', '', '', '', '_self', 0, '2015-09-14 16:59:30', '2015-09-14 16:59:30'),
               (9, 2, '藝閣路關', '', '', '', '', '_self', 1, '2015-09-14 16:59:40', '2015-09-14 16:59:40'),
               (10, 2, '陣頭遶境地圖', '', '', '', '', '_self', 2, '2015-09-14 16:59:49', '2015-09-14 16:59:49'),
               (11, 2, '藝閣遶境地圖', '', '', '', '', '_self', 3, '2015-09-14 17:00:06', '2015-09-14 17:00:06'),
               (12, 2, '2015 回顧', '', '', '', '', '_self', 4, '2015-09-14 17:11:31', '2015-09-14 17:11:31'),

               (13, 3, '駕前陣頭', '', '', '', '', '_self', 0, '2015-09-14 16:53:32', '2015-09-14 16:53:32'),
               (14, 3, '地方陣頭', '', '', '', '', '_self', 1, '2015-09-14 16:53:41', '2015-09-14 16:53:41'),
               (15, 3, '其他介紹', '', '', '', '', '_self', 2, '2015-09-14 16:53:56', '2015-09-14 16:53:56'),

               (16, 4, '白沙屯 2015 路線', '', '', '', '', '_self', 0, '2015-09-14 17:03:17', '2015-09-14 17:03:17'),

               (17, 5, '美食地圖', '', '', '', '', '_self', 0, '2015-09-14 17:04:32', '2015-09-14 17:04:32'),
               (18, 5, '在地小吃', '', '', '', '', '_self', 1, '2015-09-14 17:05:25', '2015-09-14 17:05:25'),
               (19, 5, '名勝景點', '', '', '', '', '_self', 2, '2015-09-14 17:06:13', '2015-09-14 17:06:08'),
               (20, 5, '交通資訊', '', '', '', '', '_self', 3, '2015-09-14 17:06:13', '2015-09-14 17:05:44'),

               (21, 6, '老照片說故事', '', '', '', '', '_self', 0, '2015-09-14 17:11:38', '2015-09-14 17:11:07'),
               (22, 6, '耆老回憶', '', '', '', '', '_self', 1, '2015-09-14 17:11:38', '2015-09-14 17:10:31'),

               (23, 10, '三月十九', '', '', '', '', '_self', 0, '2015-09-14 17:00:29', '2015-09-14 17:00:29'),
               (24, 10, '三月二十', '', '', '', '', '_self', 1, '2015-09-14 17:00:39', '2015-09-14 17:00:39'),

               (25, 11, '三月十九', '', '', '', '', '_self', 0, '2015-09-14 17:00:56', '2015-09-14 17:00:56'),
               (26, 11, '三月二十', '', '', '', '', '_self', 1, '2015-09-14 17:01:07', '2015-09-14 17:01:07'),
               (27, 11, '三月廿一', '', '', '', '', '_self', 2, '2015-09-14 17:01:27', '2015-09-14 17:01:27'),
               (28, 11, '三月廿二', '', '', '', '', '_self', 3, '2015-09-14 17:01:37', '2015-09-14 17:01:37'),
               (29, 11, '三月廿三', '', '', '', '', '_self', 4, '2015-09-14 17:01:46', '2015-09-14 17:01:46');");
  }
  public function down () {
    $this->db->query (
      "DROP TABLE `menus`;"
    );
  }
}